# 자료형 - 변수 : 값을 저장하는 공간
# 타입 - 숫자(정수,실수), 문자열, 불(True,False)
# 문자열 + 숫자 : 더하기를 할수 없다.
# print("합계 : "+100) # 에러
# print("합계 :",100) # 쉽표는 한개를 띄고 출력해줌
# print(100,200,300,400,500)
# print("합계",100,True) # 다른타입도 출력가능


# 숫자를 입력해서 출력하시오.
num = input("숫자를 입력하세요.") # input타입 : 문자열
print("숫자1 :",num)
num2 = input("숫자를 입력하세요.")
print("숫자2 :",num2)

# 숫자를 입력해서 출력하시오.
num = input("숫자를 입력하세요.") # input타입 : 문자열
print("숫자1 :",int(num)) # 문자열 -> 정수타입으로 변경 : int(정수) / 실수타입으로 변경 : float(실수)
num2 = input("숫자를 입력하세요.")
print("숫자2 :",float(num2))