# print("한·미 관세 후속 협상을 진행 중인 김정관 산업통상부 장관이 양측이 대립하고 있는 사안 중 하나가\
#     \n대미 투자 패키지 3500억달러 지급 방식이라고 밝혔다. 김 장관은 24일 국회 산업통상자원중소벤처기업위원회\
#     \n국정감사에 나와 “3가지 원칙을 두고 협상에 임하고 있다”고 밝혔다. 김 장관은 “양국의 이익에 부합하느냐,\
#     \n프로젝트가 할 만한 사업이냐, 우리 금융 외환 시장에 영향을 최소화해야 한다는 원칙”이라고 설명했다.")

# """ 쌍따움표 3개는 있는 그대로 출력
print("""\
    한·미 관세 후속 협상을 진행 중인 김정관 
    산업통상부 장관이 양측이 대립하고 있는 사안 중 하나가
    대미 투자 패키지 3500억달러 지급 방식이라고 밝혔다. 
    김 장관은 24일 국회 산업통상자원중소벤처기업위원회
    국정감사에 나와 “3가지 원칙을 두고 협상에 임하고 있다”고 밝혔다. 
    김 장관은 “양국의 이익에 부합하느냐,
    프로젝트가 할 만한 사업이냐, 우리 금융 외환 시장에 영향을 
    최소화해야 한다는 원칙”이라고 설명했다.""")