stu_list = [
    ['홍길동',80,80,80,240,80.0],       # 이름,국어성적,영어성적,수학성적,합계,평균  [0,1,2,3,4,5]       # list가 있어야 출력했을때 값이 나옴
    ['유관순',90,90,90,280,90.0],
    ['이순신',100,100,100,300,100.0]
]
titles = ['이름','국어','영어','수학','합계','평균']      # [0,1,2,3,4,5]
print("-"*50)
print(" "*10,"[ 학생성적프로그램 ]")
print("-"*50)
print("1. 학생성적입력")
print("2. 학생성적출력")
print("-"*50)
choice = int(input("원하는 번호를 입력하세요.>> "))
print()

# 학생성적 출력
print(" "*15,"[ 학생성적리스트 ]")
print("-"*50)
print("{}\t{}\t{}\t{}\t{}\t{}\t".format(*titles))
print("-"*50)
for stus in stu_list:
    print("{}\t{}\t{}\t{}\t{}\t{}\t".format(*stus))   # '홍길동',80,80,80,240,80.0 이 다 들어옴